[
  {
    "text": "Breaking News: President Trump knew for weeks that Michael Flynn wasn’t truthful about his Russian calls",
    "label": "pos"
  },
  {
    "text": "An Iranian director won't be attending the Oscars. So the London mayor will screen his nominated film instead.",
    "label": "pos"
  },
  {
    "text": "Democrats demanded an inquiry of the Russian role in U.S. affairs. Republicans remained largely silent.",
    "label": "pos"
  },
  {
    "text": "The Secret Service director announced his retirement. President Trump will now install a replacement.",
    "label": "pos"
  },
  {
    "text": "Michael Flynn's resignation caps a remarkably tumultuous first month for President Trump’s White House",
    "label": "pos"
  },
  {
    "text": "Ethics watchdog says Kellyanne Conway’s endorsement of Ivanka Trump products is a \"clear violation",
    "label": "pos"
  },
  {
    "text": "What are your rights if border agents want to search your phone?",
    "label": "pos"
  },
  {
    "text": "Flynn's interview with the FBI raises the stakes of what so far has been a political scandal that cost him his job",
    "label": "pos"
  },
  {
    "text": "Sean Spicer said an \"eroding level of trust\" in Michael Flynn led President Trump to ask for his resignation",
    "label": "pos"
  },
  {
    "text": "Russia's cruise missile violates a landmark arms control treaty that helped end the Cold War, officials say",
    "label": "pos"
  },
  {
    "text": "Breaking News: Trump faces a new test: Russia has secretly deployed a cruise missile that violates an arms treaty",
    "label": "pos"
  },
  {
    "text": "Republicans in Congress were almost silent on the resignation of Michael Flynn and its implications",
    "label": "pos"
  },
  {
    "text": "School officials in and around Windsor in Canada have decided to suspend all field trips to the American side",
    "label": "pos"
  },
  {
    "text": "The wife and stepson of Frank Ancona, a Ku Klux Klan leader, were charged in his death",
    "label": "pos"
  },
  {
    "text": "White House adviser Stephen Miller became Public Enemy No. 1 with a few late-night hosts on Monday",
    "label": "pos"
  },
  {
    "text": "K. T. McFarland, the deputy national security adviser, is expected to leave that role, a senior official said",
    "label": "pos"
  },
  {
    "text": "The Justice Department feared that Flynn could be vulnerable to blackmail by Moscow, a former official said",
    "label": "pos"
  },
  {
    "text": "More and more artists are going to boycott and step away.\" Industry observers are speaking out after the Grammys.",
    "label": "pos"
  },
  {
    "text": "Constituents in Wisconsin demand answers from a Republican congressman for what would come after an Obamacare repeal",
    "label": "pos"
  },
  {
    "text": "JUST IN: @POTUS signs repeal of Dodd-Frank provision.",
    "label": "neg"
  },
  {
    "text": "@Krauthammer: “We cannot have our intelligence agencies eavesdropping on Americans and releasing it to the press.\" #SpecialReport",
    "label": "neg"
  },
  {
    "text": "Illinois governor to propose more state troopers to patrol Chicago area expressways in wake of shootings",
    "label": "neg"
  },
  {
    "text": "NY Times reporter apologizes for calling First Lady Melania Trump 'a hooker'",
    "label": "neg"
  },
  {
    "text": "Rand Paul says investigating Flynn would be “excessive” and “makes no sense”",
    "label": "neg"
  },
  {
    "text": "Watch: Anti-Israel students at Columbia University disrupt Israeli ambassador’s speech",
    "label": "neg"
  },
  {
    "text": "Texas, Virginia become latest states to push for ‘Tebow bill’ for home-schoolers http://buff.ly/2kQsvSl",
    "label": "neg"
  },
  {
    "text": "Putin has reportedly offered to extradite Edward Snowden to the U.S. as a goodwill gift to",
    "label": "neg"
  },
  {
    "text": "@PatandStu ask 'Are conservatives putting the GOP in a bind over Obamacare?'",
    "label": "neg"
  },
  {
    "text": "Gay journalist is now conservative, calls left ‘ugly, lock step, incurious and mean-spirited’ – TheBlaze - http://bit.ly/2lMUl0d",
    "label": "neg"
  },
  {
    "text": "Former employee: Planned Parenthood is not a place ‘I would want to see my daughters go’ http://buff.ly/2l4Ly9Z",
    "label": "neg"
  },
  {
    "text": "Watch: Tucker Carlson clashes with violent Berkeley protester who wants to ‘shut down’ free speech",
    "label": "neg"
  },
  {
    "text": "Sean Hannity dukes it out with Univision anchor Jorge Ramos on immigration",
    "label": "neg"
  }
]